{"root":{"intent":"KankerPayudara","secret_keyword":"knkpyd","pattern":["info kanker payudara"],"type":"action","text":["*Kanker Payudara*\n\nKanker payudara merupakan suatu jenis tumor ganas yang berkembang pada sel-sel payudara. Kanker ini dapat tumbuh jika terjadi pertumbuhan yang abnormal dari sel-sel pada payudara. Sel-sel tersebut membelah diri lebih cepat dari sel normal dan berakumulasi, yang kemudian membentuk benjolan atau massa.\n\nKanker payudara dapat terjadi pada wanita dan jarang pada pria.\nGejala kanker payudara termasuk benjolan di payudara, keluarnya cairan berdarah dari puting, dan perubahan bentuk atau tekstur puting atau payudara. Penanganan tergantung pada stadium kanker. Penanganan dapat terdiri dari kemoterapi, radiasi, dan operasi."],"action":{"type":"button","data":{"Gejala":{"intent":"KankerPayudaraGejala","id":"72vmoiu1ur5ljoukkduvaod6nm","type":"action","text":["*Gejala Kanker Payudara*\n\nPada stadium dini, kanker payudara dapat tidak menunjukkan gejala tertentu. Oleh karena itu, sangat penting untuk melakukan SADARI atau periksa payudara sendiri setiap bulan, 10 hari setelah masa haid berakhir. Raba dengan teliti searah jarum jam payudara untuk mendeteksi adanya benjolan atau perubahan pada payudara. Beberapa gejala kanker payudara, antara lain:\n\n- Benjolan atau pengerasan pada payudara yang berbeda dari jaringan sekitar.\n- Darah keluar dari puting payudara.\n- Kemerahan atau pembesaran pori-pori kulit payudara yang menyerupai kulit jeruk.\n- Nyeri dan pembengkakan pada payudara.\n- Pengelupasan kulit di sekitar puting payudara.\n- Perubahan pada kulit payudara, seperti cekungan.\n- Perubahan ukuran, bentuk, atau tampilan dari payudara.\n- Puting tertarik masuk (retraksi atau inversi) ke dalam.\n- Benjolan atau pembengkakan di bawah ketiak.\n\n"],"action":{"type":"button","data":{"Kembali":{"intent":"KankerPayudaraGejalaKembali","id":"2bcevcm130j3r5gk3t1ielvf54","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["gejala kanker payudara"]},"Penyebab":{"intent":"KankerPayudaraPenyebab","id":"3uc571831vlmcoav8c0cau5jia","type":"action","text":["*Penyebab dan Faktor Risiko Kanker Payudara*\n\nKanker payudara terjadi akibat pertumbuhan abnormal dari sel-sel pada payudara. Pertumbuhan abnormal ini diduga disebabkan oleh mutasi gen yang diturunkan secara genetik. Selain itu, terdapat beberapa faktor risiko yang diduga menjadi pemicu kanker payudara, yaitu:\n\n- Jenis kelamin wanita jauh lebih tinggi dibandingkan pria.\n- Usia yang bertambah, paling banyak pada usia di atas 50 tahun.\n- Belum pernah hamil sebelumnya.\n- Kebiasaan merokok atau minum minuman beralkohol.\n- Kelebihan berat badan atau obesitas.\n- Mulai menopause pada usia lebih tua, yaitu setelah usia 55 tahun.\n- Mulai menstruasi sebelum usia 12 tahun.\n- Penggunaan alat kontrasepsi hormon dan terapi hormon setelah menopause.\n- Riwayat kanker payudara pada diri sendiri pada salah satu payudara.\n- Riwayat kanker payudara pada nenek, ibu, tante, adik, kakak, atau anak sekandung.\n- Riwayat terpapar dengan radiasi.\n"],"action":{"type":"button","data":{"Kembali":{"intent":"KankerPayudaraPenyebabKembali","id":"5nc7lgitd4crqd851l764ooc82","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["penyebab kanker payudara"]},"Jenis":{"intent":"KankerPayudaraJenis","id":"3l8s76g3goc0pbnhqp90o9r21o","type":"action","text":["*Jenis Kanker Payudara*\n\nAda beberapa jenis kanker payudara yang terbagi menjadi dua tipe yang berbeda, yaitu invasive dan non-invasive. Kanker payudara invasive terjadi ketika sel kanker telah menyebar ke bagian lain payudara. Sedangkan kanker payudara non-invasive, merupakan kondisi sel kanker belum menyebar dari jaringan aslinya. Ada beberapa jenis kanker payudara yang sering terjadi:\n\n- Ductal Carcinoma In Situ;\n- Lobular Carnicoma In Situ;\n- Invasive Ductal Carcinoma; dan\n- Invasive Lobular Carcinoma.\n\nSementara, beberapa jenis kanker payudara yang jarang terjadi adalah paget disease of the breast, angiosarcoma, hingga phyllodes tumor. Mengetahui jenis kanker payudara yang kamu alami adalah hal yang cukup penting. Hal ini akan menentukan pengobatan dan perawatan yang perlu kamu lakukan untuk mengatasi penyakit ini."],"action":{"type":"button","data":{"Kembali":{"intent":"KankerPayudaraJenisKembali","id":"4q344gom65tthkjj74k7ru2mpb","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["jenis kanker payudara"]},"Diagnosis":{"intent":"KankerPayudaraDiagnosis","id":"07nlkaumd98gvkgh1q4a086q7i","type":"action","text":["*Diagnosis Kanker Payudara*\n\nDokter akan mendiagnosis kanker payudara dengan melakukan wawancara medis lengkap, pemeriksaan fisik langsung untuk mendeteksi perubahan pada payudara serta kelenjar getah bening pada ketiak, serta pemeriksaan penunjang, seperti:\n\n- Mammogram atau foto payudara, untuk mendeteksi kelainan pada payudara.\n- Ultrasonografi (USG) payudara, untuk menentukan benjolan payudara berupa massa padat atau kista yang berisi cairan.\n- Biopsi dengan pengambilan sampel jaringan, untuk diperiksa di laboratorium dan menentukan sel yang diperiksa bersifat jinak atau ganas.\n- Computerized Tomography scan (CT scan) dan Magnetic Resonance Imaging (MRI), untuk menentukan ukuran serta penyebaran dari kanker payudara.\n"],"action":{"type":"button","data":{"Kembali":{"intent":"KankerPayudaraDiagnosisKembali","id":"5pr69c4snjgjoujjcts6kobvbr","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["(diagnosis|diagnosa) kanker payudara"]},"Pencegahan":{"intent":"KankerPayudaraPencegahan","id":"4ocqu0ljd9foe24kcqktimm31a","type":"action","text":["*Pencegahan Kanker Payudara*\n\nBeberapa upaya pencegahan kanker payudara, antara lain:\n\n- Berolahraga secara rutin.\n- Cukup istirahat.\n- Menyusui anak hingga berusia dua tahun.\n- Pemeriksaan rutin dan teliti dengan SADARI.\n- Pengelolaan stres yang baik.\n- Pola makan gizi seimbang.\n- Tidak merokok atau minum minuman beralkohol."],"action":{"type":"button","data":{"Kembali":{"intent":"KankerPayudaraPencegahanKembali","id":"2narkfnmfjgmhenhv23kgvopma","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["pencegahan kanker payudara"]},"Pengobatan":{"intent":"KankerPayudaraPengobatan","id":"0a8uks3kh25qrded772p43ai1o","type":"action","text":["*Pengobatan Kanker Payudara*\n\nPenanganan kanker payudara bergantung pada jenis kanker yang dialami, stadium kanker, ukuran massa, serta sensitivitas sel kanker terhadap hormon. Dokter akan menentukan terapi yang paling sesuai dengan keadaan penderita berdasarkan hal-hal tersebut. Beberapa pilihan pengobatan pada kanker payudara, antara lain:\n\n- Pembedahan, yang meliputi pengangkatan kanker atau benjolan (lumpektomi), pengangkatan seluruh payudara (mastektomi), pengangkatan jumlah terbatas dari kelenjar limfe (sentinel node biopsy), atau pengangkatan beberapa kelenjar limfe (axillary lymph node dissection).\n- Radioterapi, yang dilakukan dengan menggunakan energi sinar X dan proton, untuk mematikan sel-sel kanker.\n- Kemoterapi, yang dilakukan dengan menggunakan obat-obatan tertentu, untuk mematikan sel kanker.\n- Terapi penghambat hormon, jika kanker diketahui sensitif terhadap hormon estrogen atau progesteron.\n\nUmumnya, pengidap akan menjalani prosedur pembedahan untuk kanker payudara dan mendapatkan penanganan lain sebelum dan\/atau sesudah pembedahan, seperti kemoterapi, terapi hormonal, atau terapi radiasi.\n"],"action":{"type":"button","data":{"Bahaya Kemo":{"intent":"KankerPayudaraPengobatanBahaya-Kemo","id":"34af6c201olteam4uvhbpmi25e","type":"action","text":["*Efek Samping Kemoterapi*\n\nKemoterapi adalah jenis perawatan untuk mengobati kanker, dengan menggunakan obat-obatan, yang bisa mematikan sel kanker, pada tubuh pasiennya. Kemoterapi tersedia dalam berbagai bentuk, mulai dari pil atau cairan yang bisa langsung ditelan, cairan yang diinfus langsung ke dalam organ, hingga suntikan.\n\n1. Rambut rontok\n2. Melemahkan sistem kekebalan tubuh\n3. Gangguan saraf\n4. Gangguan pernapasan\n5. Mengganggu sistem pencernaan\n6. Ruam kulit\n7. Mual dan muntah\n8. Mengganggu sistem reproduksi\n\nDalam kasus yang sangat jarang terjadi, efek samping kemoterapi di atas, bisa bersifat permanen pada pasien kanker. Contohnya, kerusakan saraf permanen, yang dapat menimbulkan rasa kesemutan kronis di tangan dan kaki.\n"],"action":{"type":"button","data":{"Kembali":{"intent":"KankerPayudaraPengobatanBahaya-KemoKembali","id":"28ua8jgead5bonhub4i5r6j12k","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["bahaya (kemo|kemoterapi)","efek samping (kemo|kemoterapi)"]},"Kembali":{"intent":"KankerPayudaraPengobatanKembali","id":"02h5q95b08pcln625226ohcj45","callback_data":"info kanker payudara","type":"text","text":[""]}}},"pattern":["pengobatan kanker payudara"]}}}}}