[
    {
        "text": "Anda merasa kesulitan memperkenalkan diri ke orang lain.",
        "answer": null
    },
    {
        "text": "Anda sering tenggelam dalam pikiran sehingga Anda mengabaikan atau melupakan sekeliling Anda.",
        "answer": null
    },
    {
        "text": "Anda mencoba menjawab email Anda sesegera mungkin dan tidak tahan melihat kotak masuk yang berantakan.",
        "answer": null
    },
    {
        "text": "Anda merasa mudah untuk tetap santai dan fokus bahkan saat berada dalam tekanan.",
        "answer": null
    },
    {
        "text": "Anda tidak biasa memulai percakapan.",
        "answer": null
    },
    {
        "text": "Anda jarang melakukan sesuatu hanya karena sangat ingin tahu.",
        "answer": null
    },
    {
        "text": "Anda merasa lebih unggul dari orang lain.",
        "answer": null
    },
    {
        "text": "Menjadi orang yang teratur lebih penting bagi Anda daripada menjadi orang yang mudah beradaptasi.",
        "answer": null
    },
    {
        "text": "Anda biasanya sangat termotivasi dan bersemangat.",
        "answer": null
    },
    {
        "text": "Memenangkan debat tidak terlalu penting bagi Anda dibandingkan memastikan tidak ada orang marah.",
        "answer": null
    },
    {
        "text": "Anda sering merasa seolah-olah Anda harus menjustifikasi diri Anda kepada orang lain.",
        "answer": null
    },
    {
        "text": "Lingkungan rumah dan tempat kerja Anda sangat rapi.",
        "answer": null
    },
    {
        "text": "Anda tidak keberatan menjadi pusat perhatian.",
        "answer": null
    },
    {
        "text": "Anda menganggap diri Anda lebih praktis daripada kreatif.",
        "answer": null
    },
    {
        "text": "Orang jarang dapat membuat Anda marah.",
        "answer": null
    },
    {
        "text": "Rencana perjalanan Anda biasanya benar-benar matang.",
        "answer": null
    },
    {
        "text": "Anda sering kesulitan menghubungkan perasaan orang lain.",
        "answer": null
    },
    {
        "text": "Suasana hati Anda dapat berubah dengan cepat.",
        "answer": null
    },
    {
        "text": "Dalam suatu diskusi, kebenaran harus lebih penting daripada sensitivitas orang lain.",
        "answer": null
    },
    {
        "text": "Anda jarang merasa khawatir mengenai bagaimana tindakan Anda memengaruhi orang lain.",
        "answer": null
    },
    {
        "text": "Gaya kerja Anda lebih dekat dengan lonjakan energi yang acak daripada pendekatan metodis dan terorganisasi.",
        "answer": null
    },
    {
        "text": "Anda sering merasa iri terhadap orang lain.",
        "answer": null
    },
    {
        "text": "Buku atau permainan video yang menarik seringkali lebih baik daripada acara sosial.",
        "answer": null
    },
    {
        "text": "Mampu mengembangkan rencana dan tetap berpegang pada rencana itu adalah bagian yang paling penting dari setiap proyek.",
        "answer": null
    },
    {
        "text": "Anda jarang terhanyut oleh fantasi dan ide.",
        "answer": null
    },
    {
        "text": "Anda sering merasa tenggelam dalam pikiran saat Anda berjalan di alam.",
        "answer": null
    },
    {
        "text": "Jika seseorang tidak menjawab email Anda dengan cepat, Anda mulai khawatir apakah Anda mengatakan sesuatu yang salah.",
        "answer": null
    },
    {
        "text": "Sebagai orang tua, Anda ingin anak Anda tumbuh sebagai anak yang baik bukan anak yang cerdas.",
        "answer": null
    },
    {
        "text": "Anda tidak membiarkan orang lain memengaruhi tindakan Anda.",
        "answer": null
    },
    {
        "text": "Impian Anda cenderung fokus pada dunia nyata dan peristiwanya.",
        "answer": null
    },
    {
        "text": "Tidak perlu waktu lama bagi Anda untuk terlibat dalam kegiatan sosial di tempat kerja Anda.",
        "answer": null
    },
    {
        "text": "Anda lebih merasa sebagai pembuat perbaikan alami daripada perencana teliti.",
        "answer": null
    },
    {
        "text": "Emosi Anda lebih mengontrol Anda daripada Anda mengontrol emosi Anda.",
        "answer": null
    },
    {
        "text": "Anda menikmati acara sosial yang melibatkan kegiatan dengan pakaian khusus atau bermain peran.",
        "answer": null
    },
    {
        "text": "Anda sering menghabiskan waktu mengeksplorasi ide yang tidak realistis dan tidak praktis tetapi menarik.",
        "answer": null
    },
    {
        "text": "Anda lebih senang berimprovisasi daripada menghabiskan waktu menyiapkan rencana terperinci.",
        "answer": null
    },
    {
        "text": "Anda adalah orang yang relatif penyendiri dan pendiam.",
        "answer": null
    },
    {
        "text": "Jika Anda memiliki bisnis, Anda akan merasa kesulitan memberhentikan karyawan yang loyal tapi kinerjanya buruk.",
        "answer": null
    },
    {
        "text": "Anda sering merenui alasan keberadaan manusia.",
        "answer": null
    },
    {
        "text": "Logika lebih penting daripada perasaan jika terkait dengan membuat keputusan penting.",
        "answer": null
    },
    {
        "text": "Tetap membuka opsi Anda lebih penting daripada memiliki daftar yang harus dilakukan.",
        "answer": null
    },
    {
        "text": "Jika teman Anda bersedih karena sesuatu, Anda mungkin lebih memberi dukungan emosional daripada menyarankan cara untuk mengatasi masalahnya.",
        "answer": null
    },
    {
        "text": "Anda jarang merasa tidak aman.",
        "answer": null
    },
    {
        "text": "Anda tidak merasa kesulitan membuat jadwal waktu dan tetap berpegang padanya.",
        "answer": null
    },
    {
        "text": "Benar lebih penting daripada kooperatif jika berkaitan dengan kerja tim.",
        "answer": null
    },
    {
        "text": "Anda berpendapat bahwa pandangan setiap orang harus dihormati tanpa memandang apakah pandangan tersebut didukung fakta atau tidak.",
        "answer": null
    },
    {
        "text": "Anda merasa lebih bersemangat setelah menghabiskan waktu bersama sekelompok orang.",
        "answer": null
    },
    {
        "text": "Anda sering salah menaruh tempat barang-barang Anda.",
        "answer": null
    },
    {
        "text": "Anda melihat diri Anda secara emosional sangat stabil.",
        "answer": null
    },
    {
        "text": "Pikiran Anda selalu membayangkan ide dan rencana yang belum dieksplorasi.",
        "answer": null
    },
    {
        "text": "Anda tidak akan menyebut diri Anda seorang pemimpi.",
        "answer": null
    },
    {
        "text": "Anda biasanya merasa kesulitan untuk rileks saat berbicara di depan orang banyak.",
        "answer": null
    },
    {
        "text": "Biasanya Anda lebih mengandalkan pengalaman Anda daripada imaginasi Anda.",
        "answer": null
    },
    {
        "text": "Anda terlalu khawatir tentang anggapan orang terhadap Anda.",
        "answer": null
    },
    {
        "text": "Jika ruangan penuh, Anda berada dekat dengan dinding, menghindari bagian tengah.",
        "answer": null
    },
    {
        "text": "Anda cenderung untuk berleha-leha sampai tidak cukup waktu untuk melakukan apa-apa.",
        "answer": null
    },
    {
        "text": "Anda merasa sangat gelisah dalam situasi yang membuat tertekan.",
        "answer": null
    },
    {
        "text": "Anda yakin bahwa lebih bermanfaat disukai orang daripada menjadi orang yang berkuasa.",
        "answer": null
    },
    {
        "text": "Anda selalu tertari dengan benda-benda yang tidak konvensional dan ambigu, misalnya buku, seni atau film.",
        "answer": null
    },
    {
        "text": "Anda sering mengambil inisiatif dalam situasi sosial.",
        "answer": null
    }
]