{"root":{"intent":"ksp212","secret_keyword":"kspx","pattern":["info (ksp|ksp212)"],"type":"action","text":["*Koperasi Syariah 212* adalah Koperasi Primer Nasional yang didirikan oleh tokoh-tokoh umat Islam sebagai implementasi semangat Aksi 212 yang penuh persaudaraan dan kebersamaan. Semangat ini kemudian diwujudkan pada upaya menjadikan Koperasi Syariah 212 sebagai wadah perjuangan ekonomi untuk mencapai kemandirian ekonomi umat.\n\nkoperasisyariah212.co.id"],"action":{"type":"button","data":{"🗓 About":{"intent":"ksp212-About","id":"193b56735e689ae86a01d91513","type":"text","text":["*Koperasi Syariah 212* adalah Koperasi Primer Nasional yang didirikan oleh tokoh-tokoh umat Islam sebagai implementasi semangat Aksi 212 yang penuh persaudaraan dan kebersamaan. Semangat ini kemudian diwujudkan pada upaya menjadikan Koperasi Syariah 212 sebagai wadah perjuangan ekonomi untuk mencapai kemandirian ekonomi umat.\n\nKoperasi Syariah 212 didirikan pada tanggal 6 Januari 2017, yaitu pada saat Grand Launching Koperasi Syariah 212 di Ruang Al-Hambra, Andalusia Islamic Center, Sentul City, Bogor. Saat itu berkumpul tokoh-tokoh umat, seperti Kyai Ma’ruf Amin, Ustad Bachtiar Nasir, Ustad M. Zaitun Rasmin, Kyai Misbahul Anam, Ustad Didin Hafidhuddin, Dr. M. Syafii Antonio, dan masih banyak tokoh umat lainnya.\n\nKoperasi Syariah 212 mendapatkan pengesahan dari pemerintah melalui Surat Keputusan Menteri Koperasi dan usaha Kecil Menengah No. 003136\/BH\/M.UMKM.2\/I\/2017 yang dikeluarkan oleh Kementerian Koperasi dan UKM pada tanggal 19 Januari 2017.\n"],"pattern":["(about|tentang) (ksp|ksp212)"]},"Layanan":{"intent":"ksp212Layanan","id":"624a5ab8e8c14d73bd22d59ba7a75861","type":"action","text":["*Layanan Koperasi Syariah 212*\n\nWhat We Do\nKoperasi Syariah 212 memiliki beberapa layanan, yaitu Air Mineral 212, 212Mart, KSP 212 Mobile dan Wakaf Pengembangan Ekonomi Umat.\n"],"action":{"type":"button","data":{"🚪 Air Mineral 212":{"intent":"ksp212Layanan-Air-Mineral-212","id":"7a3sc6vdo7dppbuohigukq02da","type":"text","text":["*Air Mineral 212*\n\nAnda bisa memesan Air Mineral 212 berbagai jenis dan ukuran di sini. Klik tombolnya untuk mengirim pesan ke admin Air Mineral. Pesanan Anda akan diteruskan ke agen terdekat.\n\nairmineral212.koperasisyariah212.co.id\n"]},"🌟 212 Mart":{"intent":"ksp212Layanan-212-Mart","id":"18loneg5b4isqjdv5i9akshfil","type":"text","text":["*212 Mart*\n\n212 MART adalah brand minimarket Koperasi Syariah 212. Kepemilikan berjamaah, dikelola secara profesional dan terpusat untuk menjaga daya saingnya baik dari sisi jaringan distribusi, produk, harga maupun promo."]},"🧑‍💻 KSP 212 Mobile":{"intent":"ksp212Layanan-zwj-KSP-212-Mobile","id":"2ff1engvchn507mnifqo0l72ji","type":"text","text":["*KSP 212 Mobile*\n\nTranfer, bayar tagihan, beli pulsa dan lainnya bisa dengan biaya kompetitif melalui KSP 212 Mobile.\nkoperasisyariah212.co.id\/koperasi-syariah-212-mobile\n"]},"📞 Wakaf":{"intent":"ksp212Layanan-Wakaf","id":"439ed0c9m2p1amnoau3nm255v7","type":"text","text":["*Wakaf KSP 212*\n\nWakaf adalah sarananya. Berikan harta terbaik, manfaatkan untuk ibadah umat dan kemaslahatan bersama. Dalam konteks Indonesia, meraih kemuliaan itu adalah Wakaf Koperasi Syariah 212, untuk pemberdayaan ekonomi umat.\n\nManfaat yang dihasilkan oleh wakaf produktif lebih luas dari wakaf pada umumnya karena dampak penerima wakaf tidak hanya diterima oleh wakif (pewakaf) tetapi masyarakat pada umumnya.\n\nPengelolaan dana wakaf di Koperasi Syariah 212 dipakai untuk bisnis lalu keuntungan tersebut dipakai secara terus menerus dan membesar mengalir pada kegiatan sosial dan dakwah umat Islam.\n"]}}},"pattern":["(service|layanan) (ksp|ksp212)"]},"Produk":{"intent":"ksp212Produk","id":"7ogr2o6inst9our68fa9dlm9f5","type":"action","text":["*Produk Koperasi Syariah 212*\n\nWhat We Do\nKoperasi Syariah 212 memiliki beberapa produk, yaitu produk pendanaan, produk pembiayaan dan produk pengembangan usaha."],"action":{"type":"button","data":{"🚪 Pendanaan":{"intent":"ksp212Produk-Pendanaan","id":"42tu82vli17sfvfvqlno2d6mo4","type":"text","text":["*Pendanaan Koperasi Syariah 212*\n\nPendanaan Koperasi Syariah 212 meliputi:\n1. Simpanan Pokok\n2. Simpanan Wajib\n3. Tabungan Investasi\/Simpanan Sukarela\n4. Wakaf Uang\n"]},"🌟 Pembiayaan":{"intent":"ksp212Produk-Pembiayaan","id":"5io86fmklh39qiludh60ir85qd","type":"text","text":["*Pembiayaan Koperasi Syariah 212*\n\nMencakup pengembangan kawasan pemukiman dan properti syariah. Produk ini didasarkan atas kerja sama pemilik lahan secara bagi hasil. Koperasi Syariah 212 akan berperan sebagai pengembang (developer) dan pemasaran ke seluruh anggota. Anggota dapat juga berperan sebagai turn key contractor. Oleh karena itu, kami mengundang segenap kaum muslimin yang memiliki lahan untuk bekerja sama mengoptimalkan lahan strategisnya. Besar harapan bahwa lahan-lahan kaum muslimin akan tetap di tangan kaum muslimin dan tidak lepas ke pihak lain.\n\n"]},"🧑‍💻 Pengembangan Usaha":{"intent":"ksp212Produk-zwj-Pengembangan-Usaha","id":"5joq0v17ouhfhk3ek94f88lc6a","type":"text","text":["*Pengembangan Usaha*\n\nSalah satu sektor strategis ekonomi ummat adalah penguasaan jaringan waralaba dan mini market secara nasional. Jaringan ini baru dapat dikembangkan seandainya supply chain berupa distribution centre telah berhasil dibangun. Sementara distribution centre baru akan ajeg ketika manufaktur kebutuhan pokok berupa makanan dan minuman serta kebutuhan harian dapat dikuasai.\n\nStrategi pengembangan usaha ini akan menjadi semakin mudah bila lembaga keuangan syariah berupa perbankan syariah, asuransi syariah, dan pasar modal syariah dapat dikonsolidasikan. Konsolidasi dapat dilakukan dalam bentuk penyertaan saham di Koperasi Syariah 212.\n"]}}},"pattern":["produk (ksp|ksp212)"]},"📞 Contact":{"intent":"ksp212-Contact","id":"67ddbcb185c94478a0aa580e9fdcd971","type":"text","text":["*Hubungi Koperasi Syariah 212*[.](https:\/\/raw.githubusercontent.com\/CarikBot\/ecosystem\/development\/data\/partner\/Ajaro\/me.png)\n\nRuko Bellanova Country Mall Blok RK 03 No. 01,\nJalan MH Thamrin No. 08, Sentul City, Babakan Madang,\nBogor, Jawa Barat 16810, Indonesia\n\nHubungi:\nwhatsapp: wa.me\/628116411212\nemail: info@koperasisyariah212.co.id\n\nSosial Media KSP212:\n- [Facebook](https:\/\/www.facebook.com\/koperasisyariah212)\n- [Twitter](https:\/\/www.twitter.com\/kopsyariah212)\n"],"pattern":["(contact|kontak) (ksp|ksp212)","(ksp|ksp212) (contact|kontak)"]}}}}}