{"root":{"intent":"Ajaro","secret_keyword":"ajr","pattern":["info ajaro","^(ajaro)"],"type":"action","text":["*Ajaro.id*\n\nAjaro merupakan sebuah perusahaan yang bergerak dibidang Teknologi dan Informasi serta fokus terhadap pengembangan sumberdaya manusia terutama generasi muda dalam bidang Teknologi.\n\najaro.id"],"action":{"type":"button","data":{"🗓 About":{"intent":"Ajaro-About","id":"193b56735e689ae86a01d91513","type":"text","text":["*About Ajaro.id*\n\nAjaro Indonesia, berdiri sejak tahun 2017. Kami merupakan sebuah perusahaan yang bergerak dibidang Teknologi dan Informasi serta fokus terhadap pengembangan sumberdaya manusia terutama generasi muda dalam bidang Teknologi. Ajaro tidak didirikan oleh satu orang saja, melainkan dibentuk dan didirikan berdasarkan mimpi, semangat dan harapan dari sekelompok orang yang ingin berbagi dan memberikan dampak positifnya terhadap masyarakat dan tentunya Indonesia tercinta.\n\nSesuai dengan salah satu visi kami, menjadi media perantara antara dunia pendidikan dan dunia kerja, mengingat semakin hari teknologi berkembang dengan pesat dan dunia pendidikan juga harus mengikuti perkembangan tersebut. Kami yakin dengan adanya perantara ini dunia pendidikan bisa menyesuaikan kebutuhan industri saat ini dan mempertemukan industri dengan tenaga kerja yang sesuai kriteria mengingat semakin meningkatnya kebutuhan industri akan tenaga kerja."],"pattern":["(about|tentang) ajaro"]},"🐝 Service":{"intent":"Ajaro-Service","id":"624a5ab8e8c14d73bd22d59ba7a75861","type":"action","text":["*Ajaro.id Service*\n\nWhat We Do\nAjaro memiliki beberapa layanan, yaitu Ajaro Coding Class, Talent Pool dan Software Development."],"action":{"type":"button","data":{"🚪 Coding Class":{"intent":"Ajaro-Service-Coding-Class","id":"7a3sc6vdo7dppbuohigukq02da","type":"text","text":["*Ajaro Coding Class*\n\nBelajar programming secara offline dengan mentor profesional dibidangnya. Kelas kami mulai dari basic, intermediate hingga advance.\n\nApa yang bisa dipelajari di Ajaro Coding Class?\n- Frontend Development\n- Backend Development\n- Database\n- Mobile Development\n- Agility"]},"🌟 Talent Pool":{"intent":"Ajaro-Service-Talent-Pool","id":"18loneg5b4isqjdv5i9akshfil","type":"text","text":["*Talent Pool*\n\nKami memberikan pelatihan kepada talent dibidang Software Development sampai siap bekerja sesuai dengan kebutuhan Industri saat ini."]},"🧑‍💻 Development":{"intent":"Ajaro-Service-zwj-Development","id":"2ff1engvchn507mnifqo0l72ji","type":"text","text":["*Software Development*\n\nKami juga membantu para pelaku bisinis untuk mengembangkan Software sesuai dengan kebutuhan bisnis mereka.[.](https:\/\/raw.githubusercontent.com\/CarikBot\/ecosystem\/development\/data\/partner\/Ajaro\/screen.png)"]},"📞 Contact Us":{"intent":"Ajaro-Service-Contact-Us","id":"439ed0c9m2p1amnoau3nm255v7","callback_data":"contact ajaro","type":"text","text":[""]}}},"pattern":["(service|layanan) ajaro"]},"📞 Contact":{"intent":"Ajaro-Contact","id":"67ddbcb185c94478a0aa580e9fdcd971","type":"text","text":["*Hubungi Ajaro*[.](https:\/\/raw.githubusercontent.com\/CarikBot\/ecosystem\/development\/data\/partner\/Ajaro\/me.png)\n\nHubungi:\nRoni, [whatsapp](wa.me\/6285722500194)\nemail: mail@ajaro.id\n\nSosial Media Ajaro:\n- [Facebook](https:\/\/facebook.com\/ajaro.id\/)\n- [Instagram](https:\/\/www.instagram.com\/id.ajaro\/)"],"pattern":["(contact|kontak) ajaro","ajaro (contact|kontak)"]}}}}}